app/controllers/oshi_profiles_controller.rb

  def create
    @oshi_profile = current_user.build_oshi_profile(oshi_profile_params)
    if @oshi_profile.save
---
INSERT INTO "oshi_profiles" ("name", "personality", "generation", "gender", "pronoun", "user_id", "created_at", "updated_at", "avatar") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @oshi_profile.update(oshi_profile_params)
---
UPDATE "oshi_profiles" SET "updated_at" = $1, "avatar" = $2 WHERE "oshi_profiles"."id" = $3  [["updated_at", "2024-06-27 08:56:38.757132"], ["avatar", "teriharu2.png"], ["id", 2]]

  def destroy
    if @oshi_profile.destroy
---
DELETE FROM "oshi_profiles" WHERE "oshi_profiles"."id" = $1  [["id", 2]]