app/controllers/subtasks_controller.rb

SELECT "third_tasks".* FROM "third_tasks" WHERE "third_tasks"."subtask_id" = $1 AND "third_tasks"."done" = $2  [["subtask_id", 9], ["done", false]]
---
  def show
    @third_tasks = @subtask.third_tasks.where(done: false)

INSERT INTO "subtasks" ("title", "body", "done", "task_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "さぶです"], ["body", "さぶだね"], ["done", false], ["task_id", 31], ["created_at", "2024-05-31 10:01:56.102820"], ["updated_at", "2024-05-31 10:01:56.102820"]]
---
  def create
    @subtask = @task.subtasks.new(subtask_params)
    if @subtask.save

UPDATE "subtasks" SET "body" = $1, "updated_at" = $2 WHERE "subtasks"."id" = $3  [["body", "さぶですよお"], ["updated_at", "2024-05-30 09:29:40.827187"], ["id", 6]]
---
  def update
    if @subtask.update(subtask_params)

DELETE FROM "subtasks" WHERE "subtasks"."id" = $1  [["id", 10]]
---
  def destroy
    @subtask.destroy

UPDATE "subtasks" SET "done" = $1, "updated_at" = $2 WHERE "subtasks"."id" = $3  [["done", true], ["updated_at", "2024-05-31 11:03:33.351978"], ["id", 9]]
---
  def done
    if @subtask.done
      @subtask.update(done: false)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
---
  def set_task
    @task = Task.find(params[:task_id])

SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."task_id" = $1 AND "subtasks"."id" = $2 LIMIT $3  [["task_id", 31], ["id", 9], ["LIMIT", 1]]
---
  def set_subtask
    @subtask = @task.subtasks.find(params[:id])