app/controllers/tasks_controller.rb

  def index
    @tasks = @user.tasks.where(done: false)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."done" = $2  [["user_id", 1], ["done", false]]

  def create
    @task = @user.tasks.new(task_params)
    if @task.save
---
INSERT INTO "tasks" ("created_at", "updated_at", "user_id", "title", "body", "done") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2024-05-29 00:02:52.255554"], ["updated_at", "2024-05-29 00:02:52.255554"], ["user_id", 1], ["title", "こんにちは"], ["body", "あああ"], ["done", false]]

  def update
    if @task.update(task_params)
---
UPDATE "tasks" SET "updated_at" = $1, "body" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2024-05-28 20:23:17.873936"], ["body", "レポート作成、レビュー"], ["id", 18]]

  def done
    @task.update(done: !@task.done)
---
UPDATE "tasks" SET "updated_at" = $1, "done" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2024-05-28 23:55:57.899503"], ["done", false], ["id", 24]]

  def set_task
    @task = @user.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 24], ["LIMIT", 1]]