app/controllers/tasks_controller.rb

SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."task_id" = $1 AND "subtasks"."done" = $2  [["task_id", 31], ["done", true]]
---
  def show
    @subtasks = @task.subtasks.where(done: false)