app/controllers/third_tasks_controller.rb

  def set_subtask
    @subtask = Subtask.find(params[:subtask_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]