app/controllers/third_tasks_controller.rb

  def create
    @third_task = @subtask.third_tasks.new(third_task_params)
    if @third_task.save
---
INSERT INTO "third_tasks" ("title", "body", "done", "subtask_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "３個目だよ"], ["body", "あああ"], ["done", false], ["subtask_id", 9], ["created_at", "2024-05-31 09:19:55.209853"], ["updated_at", "2024-05-31 09:19:55.209853"]]

  def update
    if @third_task.update(third_task_params)
---
UPDATE "third_tasks" SET "title" = $1, "updated_at" = $2 WHERE "third_tasks"."id" = $3  [["title", "サードタスク"], ["updated_at", "2024-05-31 10:42:36.628709"], ["id", 5]]

  def destroy
    @third_task.destroy
---
DELETE FROM "third_tasks" WHERE "third_tasks"."id" = $1  [["id", 1]]

  def done
    if @third_task.done
      @third_task.update(done: false)
---
UPDATE "third_tasks" SET "done" = $1, "updated_at" = $2 WHERE "third_tasks"."id" = $3  [["done", true], ["updated_at", "2024-05-31 09:19:58.136772"], ["id", 1]]

  def set_subtask
    @subtask = Subtask.find(params[:subtask_id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
SELECT "subtasks".* FROM "subtasks" WHERE "subtasks"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def set_third_task
    @third_task = @subtask.third_tasks.find(params[:id])
---
SELECT "third_tasks".* FROM "third_tasks" WHERE "third_tasks"."subtask_id" = $1 AND "third_tasks"."id" = $2 LIMIT $3  [["subtask_id", 9], ["id", 1], ["LIMIT", 1]]